{"sessions":[{"id":"1","title":"Add Some Charm to your Windows Store Apps","track":"Object Oriented Languages","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Greg Lutz","presenter_id":"18","description":"This session is all about building apps for the Windows Store and showing how you can take advantage of the new charms feature of Windows 8. The charm bar provides new and exciting ways to integrate your app with Windows 8 such as file share between apps, app-wide search, printing, settings and more. We’ll look at all you can do with charms and the simple steps you need to take in your code.","length":"30","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"2","title":"Driving Quality Improvement and Reducing Technical Debt with the Definition of Done","track":"Agile\/Process","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Noopur Davis","presenter_id":"47","description":"Do your projects have to meet corporate quality goals? Does your organization operate in a regulatory environment, such as FDA regulations? Does your project have non-functional requirements such as performance, scalability, security, or safety? Or are you just tired of mounting technical debt? If the answer to any of these questions is yes, or if you just want to improve product quality, find out how the Definition of Done can be used to address these problems. We faced these issues with many teams we coached and mentored: through trial-and-error, we have developed a multi-level application of the Definition of Done to address these issues: story-level, iteration level, and release level. Quantitative results will be presented to show how product quality improves and technical debt is reduced as the Definition of Done becomes more stringent. Real world examples of the application and evolution of a Definition of Done and the results achieved will be presented.\r\rI have used the multi-level Definition of Done to coach dozens of teams in several organizations to reach their stringent quality and compliance goals, including teams working in the security and FDA regulated environments. The real world examples I plan to use include both examples of what not to do, examples of what worked well (including empirical evidence to show that it worked well), as well as examples from scaled agile implementations with multiple, geographically distributed teams. I will start with some basics such as: What is Definition of Done? How is it different than User Story Acceptance Criteria? Why do we need multi-level Definitions of Done? How do you implement these?","length":"30","room":"Room 310","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"3","title":"I Am a Front-End Web Dev (And So Can You!)","track":"JavaScript, Presentation","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Julie Pagano","presenter_id":"39","description":"Want to improve your front-end web development skills, but aren't sure where to start? Then this is the talk for you! We'll learn about HTML, CSS, JavaScript, and more. This crash course will give you a jumpstart and point you in the right direction to learn more.","length":"30","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"4","title":"Redesign is not a four letter word","track":"Object Oriented Languages","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Adam Kalnas","presenter_id":"2","description":"Technical debt happens.  Sometimes you dig your own grave and other times you inherit a messy codebase.  This talk is about what to do when you find yourself in a similar situation.  I'm going to share a story about an unmaintainable codebase that I found myself in and the redesign effort that my team went through to bring it up to snuff.  I'll be sharing some lessons learned and techniques that we found to be particularly helpful.","length":"30","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"5","title":"Valuation: Determining the value of equity in early-stage high-risk companies","track":"Business of Software","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Eric Silver","presenter_id":"57","description":"Whether you're asking others to invest in you or being asked to take on a developer or CTO role at an early tech startup, figuring out what equity is worth is a problem that many devote their entire careers to.  How can you come up with an answer that fairly values your time and potential?","length":"30","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"6","title":"User Experience : UI Design Prinicples","track":"Presentation","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Hemant Singh","presenter_id":"22","description":"Lets explore the various design principles which in turn lays the foundation for a good user experience.\r\rWith each passing day, there is more and more emphasis being put on the design and user experience for an application (often the bane of application developers).\r\rThe talk explores some of the major design principles, shares some examples, things to do, things to avoid and is more of an introduction to various principles to keep in mind during application development.","length":"30","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"7","title":"Sharding your Rails Database","track":"Object Oriented Languages, Relational Database","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Carol Nichols & Chris Winters","presenter_id":"10","description":"At the end of this talk, you will know why and when you may want to shard the database your Rails application is using (Hint: never). If you decide you really do want to shard your database (seriously, don't), you'll learn how you can do it (with the db-charmer gem). You'll learn the difference between vertical and horizontal sharding. You'll hear about the the problems you'll face when you need to switch shards or query across shards. And you'll understand how sharding changes how you think about your app's data model going forward. Friends don't let friends shard without seeing this talk.","length":"30","room":"Ryan Room","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"8","title":"Using Selenium for Web Automation Testing","track":"Testing","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Jorge Balderas","presenter_id":"35","description":"Selenium is a great framework for automating testing of Web 2.0 applications. This session will be a hands on tutorial for scripting a test of a Web 2.0 application.","length":"30","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"9","title":"Powershell for n00bs","track":"DevOps","timeslot":"1:15 - 1:45","timeslot_id":"11","presenter":"Adam Mikolaj","presenter_id":"58","description":"Powershell for n00bs will cover basic powershell commands as well as some useful real world scenerios where using powershell will make your life easier. \rIf you have heard about powershell but have never used this, come check out what all the fuss is about. \rWe will be covering:\r Basic Powershell commands\r Your first USEFUL script\r Running this script\r \rWhy work harder when powershell can for you?","length":"30","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"10","title":"What is Adobe ColdFusion?","track":"Presentation","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Reed Powell","presenter_id":"48","description":"Adobe ColdFusion is a web application development language that's been around  since 1995, but has not been seen widely in the 'burgh.  With capabilities similar to php, dot-net, jsp, Perl, etc., it is a great language for quickly developing data-driven and rich websites.  This is an overview of the language and how it can be used.","length":"30","room":"Room 312","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"11","title":"AWS and Big Data","track":"Cloud","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"William Oberman","presenter_id":"56","description":"Lessons learned from transitioning from home brew analytics\/Hadoop to AWS hosted EMR.","length":"30","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"13","title":"Convey: literal function literals","track":"Functional Languages","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Aaron J. Radke","presenter_id":"1","description":"Convey is a functional programming language experiment with a concise function literal syntax.  A functional language emphasizes functions as first class citizens like numbers and strings. However many languages do not offer a function syntactically simple as numbers or strings.  Convey experiments with making them very simple.\r\rIn addition to this there are a number of other non standard language elements that provide clean and concise code.  These include: consistent left to right data flow, white space for parenthesis, automatic quotes for string literals.\r         \rConvey is built on top of scala and receives it's functional power from scala and the powerful scala collection library.  This also provides access to the many scala and java libraries.  Convey can also be used in a \"symbiotic language\" mode compiled to javascript or a DSL mode emitting LaTeX. \r\rI merely hope to offer some mental stimulation. You will likely not adopt `convey` but I hope you will find the way it solves problems interesting.","length":"30","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"14","title":"Getting Real with D3","track":"JavaScript, Presentation","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Nate Good","presenter_id":"45","description":"There is no shortage of data visualization libraries. D3 however takes a refreshing new approach to visualizing data.  It concerns itself less with plotting or drawing and focuses more on the core of data visualization – the data.\r\rThis talk will introduce the D3 way of data visualization thinking and discuss how Node.js fits into the mix to make compelling real time visualizations. The presentation will use several demos including a real time interactive demo with audience participation.","length":"30","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"15","title":"It’s Cool, Nobody Else Knows What They’re Doing Either","track":"Career","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Jared Faris","presenter_id":"25","description":"Learning is hard. Learning to be a great developer can be really hard. I’ve talked to a lot of developers who don’t think they are as smart as the people they work with. A common worry is that others will figure out that they’re ‘faking it’. The interesting thing is, a lot of ‘brilliant’ developers we know or follow online feel the same way. You might feel like this at work but your boss probably does too.\r\rIn this talk we’ll dive into how people learn and measure their knowledge. We’ll use Steve Schwartz’s “Three Types of Knowledge” as a framework to look at what separates a great senior developer from someone just starting. We’ll talk about imposter syndrome; the feeling that you’re not good enough and eventually someone is going to find out. Then we’ll talk about how we as individuals and teams can overcome these issues and reach our full potential. Finally, we’ll look at how we can positively (and accurately) signal our expertise to others.","length":"30","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"16","title":"News Ways to Think About Networking","track":"Career","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Jackie Vesci","presenter_id":"24","description":"The term \"networking\" in business tends to frighten people away from making strong connections in their communities. Most people think about suits and ties, boring powerpoint presentations, and uncomfortable small talk. I will introduce my website, 3HourLocal.com - Events to Connect Pittsburgh, and discuss networking events that are welcoming, inspiring, and fulfilling.","length":"30","room":"Ryan Room","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"17","title":"Postgres Demystified","track":"Relational Database","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Craig Kerstiens","presenter_id":"12","description":"Postgres has long been known as a stable database product that reliably stores your data. However, in recent years it has picked up many features, allowing it to become a much sexier database.\r\rWe'll cover a whirlwind of Postgres features, which highlight why you should consider it for your next project. These include:\r\r* Datatypes\r* Using other languages within Postgres\r* Extensions including NoSQL inside your SQL database\r* Accessing your non-Postgres data (Redis, Oracle, MySQL) from within Postgres\r* Window Functions","length":"30","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"18","title":"The Name Game","track":"Agile\/Process","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Scott Smith and Lou Laughlin","presenter_id":"52","description":"A fun activity, that helps people actualize why we limit work in progress, followed by a discussion of multi-tasking and WIP limits in an Agile work environment.","length":"30","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"19","title":"Use Ruby to Write (and Test) Your Next Android App","track":"Mobile, Object Oriented Languages, Testing","timeslot":"10:30 - 11:00","timeslot_id":"12","presenter":"Joel Byler","presenter_id":"29","description":"By now, many of you have heard of the Ruby Motion project which aims to enable a Ruby developer the ability to develop an iOS application in Ruby. I want to raise awareness of the Android counterpart which is called Ruboto. Ruboto uses JRuby to gain access to the Android library from within ruby code.  I'd like to create a simple Ruboto application with RSpec tests and walk the audience though the experience.  The source code for the final application will be shared on github.","length":"30","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"20","title":"Ruby Under the Hood","track":"Object Oriented Languages","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Bill Laboon","presenter_id":"6","description":"Many people have seen the famous presentation on how Ruby on Rails can make a blog in fifteen minutes.  I'm going to take the opposite tack - explain how Ruby can count to ten over the course of an hour.  \r\rThis presentation starts with a simple piece of code - \"10.times { |n| puts n }\".  I'll show you how Ruby takes that code, turns it into tokens, parses those tokens into an abstract syntax tree, turns that tree into virtual machine instructions, and finally executes those instructions.  Along the way, we'll discuss how this can impact your own Ruby coding, like why you should never create Ruby strings longer than 23 characters if you really care about performance.\r\rYou'll gain a newfound understanding and appreciation for everything that's happening in Ruby under the hood!","length":"60","room":"Ryan Room","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"21","title":"The Whole Enchilada","track":"Mobile, Testing","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Dave Shah & Steve Jackson","presenter_id":"15","description":"The Whole Enchilada\rInception to delivery in just 2 weeks\r\rAgility & Collaboration\rTest Driven Development\rTools of the trade\rDelivery \/ Open Source\rWe could have built a simple \"hello world app\" to demonstrate how we do things. That would be lame. Instead, we decided to find a local customer and demonstrate on a small scale how we rock out apps @LeanDog We will take you through the entire process from the initial planning, to testing, building, and deploying a native Android application for our local lunch favorite - Ohio City Burrito.","length":"60","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"22","title":"Better Mapping with Shapely","track":"lamP","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Alison Alvarez","presenter_id":"3","description":"This talk will be about using the Python package Shapely, its features, and how to use them to build better maps and data visualizations.  We will talk about projecting data from one geography into another one, building shapes on the fly, and taking advantage of the shapely library to pre-aggregate data and maximize performance.","length":"60","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"23","title":"Designing for Windows 8","track":"Presentation","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Brent Schooley","presenter_id":"8","description":"Taking inspirational cues from Bauhaus design, International Typographic Style, and cinematography, the Windows 8 UI design style brings an application to life while presenting content clearly and beautifully. This session is intended to help developers and designers understand the design concepts and basic building blocks of the Windows 8 user interface.  In this session, you will be introduced to the principles behind this design style and learn how to effectively apply these principles in your applications.","length":"60","room":"Room 310","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"24","title":"Hack the Planet","track":"Security","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Dane Morgridge","presenter_id":"14","description":"The best way to learn how to protect yourself is learn the techniques that will be used against you. This session is an intro to hacking using the tools that black-hat hackers use on a regular basis to detect and exploit vulnerabilities and how to protect yourself against them. Learn how horribly unsecured Wi-Fi is and some of the most common web site vulnerabilities.","length":"60","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"25","title":"How to (not) Get Rich Writing Books","track":"Career","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Larry Ullman","presenter_id":"42","description":"Many technical people have considered, or just generally like the idea of, writing a book. Ever since I started my first one 13 years ago, this is feedback I've repeatedly heard. But despite the amount of information already available on the subject, most of those interested still don't know what publishing entails and how lucrative (or not) it really is. And the rise of self-publishing adds another realm of options that the potential author has to ponder.\r\rIn this presentation I will share with the audience the most important things I've learned about writing, publishing, and self-publishing, based upon the 24 books I've written, the multiple publishers I've worked with, and my first venture into self-publishing. The audience will leave the presentation with hard data, real-world advice, and practical tips for how they can pursue publishing, should they still be inclined.","length":"60","room":"Room 312","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"26","title":"HTML5 \/ JavaScript for Mobile Development","track":"JavaScript, Mobile","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Richard Ashkettle","presenter_id":"50","description":"Writing your app in one codebase and being able to target to multiple platforms can be a major productivity saver.  Given the multiple methods to wrap such apps as native on Android, IOS and WIN8 devices, this ideal is closer and closer to reality.  \r\rI'll discuss frameworks and their relative merits and build a simple app that will look and feel as if coded natively on each device.","length":"60","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"27","title":"Introduction to Knockout.js","track":"JavaScript","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"John V. Petersen","presenter_id":"34","description":"If you are a web developer, then Knockout.js is one of those “must haves” in your JavaScript toolbox. Knockout.js is an open source JavaScript library written by Steve Sanderson, member of MS’s ASP.NET team. Knockout.js is based on the Model View View Model pattern. In this session, John will cover the basics of what the MVVM pattern is, how its employed in Knockout.js and how to employ Knockout.js in your applications.","length":"60","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"28","title":"The Data Bath","track":"Relational Database","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Rich Dudley","presenter_id":"49","description":"On a trip to my local library's music listening room, I decided to listen one of my favorite bands.  I found entries for AC\/DC, ACDC and AC-DC.  Seriously?  How did that get out the door?  In reality though, many of us manage systems with a great deal of data in a similar state.  In this session, we'll discuss some of the basics of information quality (\"three entries for the same band???\") and entity resolution (\"are these the same band?\") as well as some techniques to clean up our data.  The background information is applicable to everyone, techniques will be demonstrated in C#\/SQL Server (although one library we'll use is a C# port of a Java library).","length":"60","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"29","title":"Stop overusing regular expressions!","track":"Functional Languages, JavaScript, lamP, Object Oriented Languages","timeslot":"11:15 - 12:15","timeslot_id":"13","presenter":"Franklin Chen","presenter_id":"17","description":"Regular expressions are very commonly used to process and validate text data. Unfortunately, they suffer from various limitations. I will discuss the limitations and illustrate how using grammars instead can be an improvement. I will make the examples concrete using parsing libraries in a couple of representative languages, although the ideas are language-independent. (I'll try to squeeze in, say, Ruby, Python, JavaScript, Scala.)\r\rI will emphasize ease of use, since one reason for the overuse of regular expressions is that they are so easy to pull out of one's toolbox.","length":"60","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"30","title":"Windows Azure – Lessons from the Field","track":"Cloud","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Michael S. Collier","presenter_id":"44","description":"The demos and presentations that show you how awesome a certain technology is are certainly exciting. But, let’s be real – there are often times when the demo “happy path” doesn’t work for real-world projects. Creating production ready Windows Azure applications often require deviating from the “next, next, publish, magic, let’s party” path often seen. In this session we will pull back the curtains on common Windows Azure scenarios such as debugging and diagnostics, environment setup, build and deployment process, Access Control Services (ACS), and role upgrades – just to name a few. Coming away from this session you’ll have gained valuable, real-world inspired knowledge you can apply to your Windows Azure applications right now!","length":"60","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"31","title":"Unit Testing with Fakes and Mocks in Visual Studio 2012","track":"Testing","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Brian Minisi","presenter_id":"9","description":"One of the basic tenets of unit testing is the code you are testing should not have dependencies on other code.  This guarantees that if a unit test fails, it is not caused by something other than the method under test.  In the case when a method does depend on other code, Fakes and Mocks can be used to intercept calls to code outside of the method under test.  This provides full control over your tests.  This session will explore the use of Stubs and Shims using Microsoft Fakes.  We will also look at how Mocks differ by enabling behavior verification using Moq.","length":"60","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"32","title":"Agile Requirements Management","track":"Agile\/Process","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Kim Hardy","presenter_id":"40","description":"I took a beloved picture book with me to a contract and set it high on a shelf in my cube. It is called If You Give a Mouse a Cookie by Laura Joffe Numeroff and Felicia Bond. I loved reading this book to my children when they were young. We would laugh so hard as the boy gets totally exhausted providing for the little mouse's every whim that all began with giving him a harmless cookie. It was a cookie that tasted so good that a glass of cold creamy milk was inevitable.\rSo why did I take the book to work? Everytime I got a chance to explain why (which was often) I would say that it was the basis for my theory of requirements management which is... when you present a software build to your customer, if it is bad they will ask you to fix it. But if it is good they will ask for the next best thing. And if it is very, very good... they will get so excited that they will ask you for the moon! This is why I am so fond of Scrum.\rUsing a Product Backlog and Scrum, you can iteratively build great software that sparks such incredible creativity in customers that all kinds of wonderful things can be imagined.\rPlease join me as we explore the Product Backlog and the talents and tasks needed to keep it groomed and ready for development.","length":"60","room":"Room 310","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"33","title":"An introduction to Git for Visual Studio Developers","track":"Configuration Management","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Irwin Hurst","presenter_id":"23","description":"I have used many version control systems over the years but never had a reason to use Git. As Microsoft open sources more and more of its own code it is only a matter of time before you will need to know more than the basics.  As a new user myself, I will introduce you to Git from the point of view of a Visual Studio developer.  During the session we will have access to a GitHub project that you can use to try everything as we learn it.","length":"60","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"34","title":"Deploying Riak on Amazon Web Services","track":"Cloud, NoSQL Database","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Hector Castro","presenter_id":"20","description":"Public and hybrid cloud deployments have become increasingly popular. Whether it's to address burst capacity issues, tenancy\/location concerns, or facilitate a simple proof-of-concept implementation prior to hardware acquisition. We'll go through a handful of Riak [0] deployment options on Amazon Web Services (AWS) and then focus on performance tuning details.\r\r[0] Riak is an open source, distributed database that was architected for availability, fault-tolerance, operational simplicity, and scalability: https:\/\/github.com\/basho\/riak","length":"60","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"35","title":"Having Your Coffee in the .NET World","track":"JavaScript","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Jerrel Blankenship","presenter_id":"28","description":"\"CoffeeScript is a little language that compiles into JavaScript.\" This language gives developers a way to get to the \"Good Parts\" of JavaScript. It allows us to write clean JavaScript and until recently has been a pain to use on Windows. That has changed. \r\rIn this talk, I will show you how to use CoffeeScript in your .NET project. We will look at Visual Studio Extentions that allow you to write and compile CoffeeScript from inside Visual Studio. By the end of this talk you will have the knowledge to go out and start using the \"Good Parts\" of JavaScript in your application. There will be numerous code examples so bring your computers and join in on the fun of writing CoffeeScript in the .NET world.","length":"60","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"36","title":"Influencing teams with psychology","track":"Agile\/Process, Career","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Dr. Charles Suscheck","presenter_id":"16","description":"Self directed agile teams don't have hierarchical management, so directly influencing the team direction is not about command and control, it takes something else. \r\rThis session is about using psychological tools to influence team members who don't report to you. If you need to influence others, this talk will give you the tools. Through examples and practical examples targeted to selling agile concepts, you will apply Cialdini's psychological tools (reciprocity, scarcity, commitment consistency, authority, liking, and social proof) to craft persuasive positions.\r\rThis presentation was given at agile 2012 to a standing room only crowd - in the 200+ range.  It was extremely well received.","length":"60","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"37","title":"Introduction to NoSQL databases with MongoDB","track":"NoSQL Database","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Hector Correa","presenter_id":"21","description":"You’ve heard the buzz about NoSQL databases, should you care? Are they for you? Why are they so popular these days?\r\rThis session is an introduction to NoSQL databases. We’ll review what is considered a NoSQL database, what do they give us, when should we use them, when should we not use them, and what kind of NoSQL databases are out there. \r\rAll examples for this talk will be given using MongoDB, an open-source, document-oriented database that is part of the NoSQL databases, but the concepts apply to most NoSQL databases.","length":"60","room":"Ryan Room","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"38","title":"Node.js Design Patterns for the Discerning Developer","track":"JavaScript","timeslot":"2:00 - 3:00","timeslot_id":"14","presenter":"Constantine Aaron Cois","presenter_id":"11","description":"Node.js brings JavaScript to the server-side. The up-side of this is an excellent event-based backend framework capable of lightning fast real-time interactions. The down-side is the baggage: the bulk of bad coding habits and antipatterns left over from frontend JavaScript that silently creep their way into Node.js codebases. Think plague-infected ninjas. In addition, the asynchronous nature of file and network I\/O inherent to Node.js can cause its own array of headaches. \r\rDiscerning developers want more. \r\rIn this session, I’ll fight the good fight by presenting some high-quality design patterns for Node.js applications. I’ll bring to the table design patterns I’ve stumbled across in my own Node projects, as well as patterns observed from the classiest members of the Node community. Examples include:\r\r* Defining your models with ORMs such as Mongoose\r* Using Async.js to avoid callback hell\r* The batch pattern for asynchronous concurrent file I\/O\r* ...and much more!\r\rTop hat and monocle encouraged, but not required.","length":"60","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"39","title":"Single Page Application with HTML, CSS, Javascript and Web API","track":"JavaScript, Object Oriented Languages, Presentation, Relational Database","timeslot":"2:00 - 4:30","timeslot_id":"15","presenter":"John Hidey, Sujesh Arukil","presenter_id":"32","description":"John Hidey and Sujesh Arukil will walk you through creating a single page application from ground up. Watch as they build a simple web application using various Javascript libraries, modular client side techniques & Web API Services. The session will see lot of wonderful libraries being used such as Knockoutjs, requirejs, crossroads, Amplify .etc. as well as setting up the server side components using Entity Framework and Web API.","length":"60","room":"Room 312","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"40","title":"Users Don’t Scroll!  …and Other UX Myths","track":"Presentation","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Benjamin Bykowski","presenter_id":"5","description":"Too often does good UX design fall prey to “conventional wisdom” and an app or website is hijacked by stakeholders way too eager to believe theoretical nonsense, without any credible proof or even their own relevant experience. In this session, we will explore some of the more common pitfalls of UX mythology, from the legendary Adventures Beyond the Page Fold, to The 3 Clicks of Destiny, to The Faceted Navigation of Doom and more! We’ll look at each in turn and determine if each holds true or can be labeled as busted. There will be audience participation and prizes including the latest season of Myth Busters and a copy of Steve Krug’s, Rocket Surgery Made Easy. Armed with the truth, you will be able to reliably defend against the onslaught of poor UX, perpetrated by design-by-committee, and reach true UX harmony.","length":"60","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"41","title":"Scaling out with Akka Actors","track":"Cloud, Functional Languages","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Josh Suereth","presenter_id":"37","description":"Erlang has made popular the notation of asynchronous message passing as means of distribution and Scaling. While the idea of \"actors\" is fundamentally simple, how do we, the software engineers, make use of this abstraction to develop real life, scalable systems? This talk designs a scalable distributed search service using Akka and Scala using the \"zen\" of Actor based design. It covers the practical aspects of *how* to scale out with akka’s new clustering API.  We’ll investigate how to determine dynamically determine when to further shard an application and how to rebalance a distributed system when adding new nodes to a cluster.  We’ll cover Akka-specific concepts and APIs, like partitions and cluster membership events.\r\rKnowledge Level: Intermediate","length":"60","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"42","title":"The class that knew too much: refactoring spaghetti code","track":"Object Oriented Languages","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Matthew D. Groves","presenter_id":"43","description":"The Single Responsibility Principle states that a class should have one (and only one) reason to change. Classes that don't adhere to this principle can result in tightly coupled spaghetti code that leads to more bugs and higher maintenance. We'll look at how to identify these classes by using some heuristics and looking for \"code smells\", and we'll clean them up using refactoring tools, design patterns, dependency injection and even aspect-oriented programming. Examples will be in C#, but the concepts can be applied to a variety of languages.","length":"60","room":"Room 310","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"43","title":"AngularJS - single page application development","track":"JavaScript","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Ben Lesh","presenter_id":"4","description":"How to develop a single page application against a restful web service with Angular. Including custom controls, form validation, two way binding and output formatting.","length":"60","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"44","title":"Create Interactive Systems with Processing","track":"Object Oriented Languages","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Joshua Sager","presenter_id":"38","description":"Processing is a powerful language behind Interactive art and data visualizations. This talk will introduce processing and basic Object Oriented Programming concepts to create interactive systems. This talk would be best as a workshop but could also be an informative way to get current developers working with processing and also non programmers started writing processing sketches in a matter of minutes.","length":"60","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"45","title":"Get Git in Three Easy Steps","track":"Cloud","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Klaatu","presenter_id":"41","description":"Learn all about git, the game-changing version\rcontrol system used for the Linux Kernel, social coding sites like\rgitorious and github, and much more. Learn how to use it, start your\rown git repository, and implement it for everything coding to file\rsharing. Spoiler alert: the title is lying, it won't be in three easy\rsteps, but it will be fun and informative.","length":"60","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"46","title":"I like my jQuery plugins warm and toasty","track":"JavaScript","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"John K. Paul","presenter_id":"33","description":"With Backbone, don’t leave your jQuery plugins shivering out in the cold production air.  We can keep them warm and toasty in a coat of Backbone view goodness. Gone are the days when we just copy and paste plugin files and start hacking in our script tags. Now that we have the expressiveness and modularity of Backbone views to manage our application behavior we can build a reusable facade for jQuery plugins..  I’m going to provide a guide to wrapping our jQuery plugins cozily in Backbone views.\r\t\rI’ll be giving you an alternative to large spaghetti .render() methods that make every jQuery plugin initialization call. I’ll walk you through the key tactics in decomposing a plugin into it’s core functionality and explain how to flexibly build your backbone view. We will also discuss the best patterns and styles for wrapping different kinds of jQuery plugins.  Most notably, I’ll be going through the process of wrapping jCarousel in a Backbone view that can be reused in many different situations.","length":"30","room":"Ryan Room","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"47","title":"Objective-C can do WHAT?!?!","track":"Mobile, Object Oriented Languages","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Josh Gretz","presenter_id":"36","description":"MVC can be a great pattern, but all too often in iOS, you end up with 1000+ line controllers that taunt you. When you start to dissect the issue, you discover that so many of those lines are just plumbing, x.foo = bar.\r\rSo how do you do you make it better? In this talk, I'll show you patterns that make your code more SOLID, and black magic that can make the plumbing code \"disappear\". We'll delve into how introspection, categories, swizzling, and IOC \/ DI enable us to craft elegant, succinct code. We can put away our hammers (and plungers) and start focusing on the code that brings the idea to life.\r\rPlease come join the session that will leave you saying, \"Objective-C can do WHAT ?!?!\"\"","length":"60","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"48","title":"Y U No test your JavaScript?!","track":"JavaScript, Testing","timeslot":"3:30 - 4:30","timeslot_id":"16","presenter":"Jeremy Jarrell","presenter_id":"27","description":"\"JavaScript development has exploded in recent years with complex client side JavaScript frameworks becoming more and more the norm.  Furthermore, JavaScript has broken free of it's client side roots and is now taking on the server.  However, through all of this growth automated testing of JavaScript still continues to lag.  \r\rBy the end of this session you'll know how to quickly get started testing JavaScript, what tools and frameworks can help make your life easier, and...most importantly...how to write your JavaScript in a testable way.\r\rJavaScript is quickly becoming a first class language in any developer's toolbox.  Isn't it time we treated it that way?\"","length":"60","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"49","title":"SQL Server for the Accidental DBA","track":"Relational Database","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Craig Purnell","presenter_id":"13","description":"So the DBA quit and now you’re stuck running the database server.  We will review the SQL Server stack for non-database professionals.  Also, a discussion of some of the most critical things that developers will need to know when managing a SQL Server where there is no professional DBA to be found. Some tips on how and where to reach out for help with problems and questions, and common gotchas and problems you may see in the field.","length":"60","room":"Room 316","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"50","title":".NET Reactive Extensions","track":"4","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Jason Agostoni","presenter_id":"26","description":"Create worry-free, asynchronous, reactive programs using the .NET Reactive (Rx) Extensions. Jason will show you how to leverage these extensions to convert your application from a boring foreach() loop to an elegant set of reactive elements for a more maintainable and safer experience.","length":"60","room":"Ryan Room","notes":null,"created":null,"modified":"2013-05-26 01:02:12","active":"1","track_id":null},{"id":"51","title":"\"this\" isn't what you think it is: JavaScript for Object oriented programmers","track":"JavaScript","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Joel Cochran","presenter_id":"30","description":"JavaScript is not just for DOM manipulation: with its growing presence in browsers, on servers, and now the desktop with Windows 8, JavaScript is fast becoming the ubiquitous programming language. Regardless of your background, odds are pretty good that JavaScript will be part of your future. JavaScript has a unique feature set that can make it challenging for object oriented programmers. In this introductory session we'll discuss some of JavaScript's pitfalls and strengths. We'll take a look at strategies for developing JavaScript namespaces, classes, and objects from an object oriented perspective.  We'll also discuss some of the more popular JavaScript libraries that you'll definitely want to have in your toolbox.","length":"60","room":"Room 103","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"52","title":"Better Features Through Backlog Grooming","track":"Agile\/Process, Business of Software","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Nivia Henry","presenter_id":"46","description":"The concept of GIGO (Garbage In, Garbage Out) is universal, and nowhere is it more prevalent than in software. Yet, software provides a fertile environment for the concept of VIVO (Value In, Value Out) to thrive. In this session, we'll explore techniques to deliver value through better grooming of inputs.\r\rSession Overview:\r1. Definition of a strong story and acceptance criteria\r2. Overview of backlog grooming & its role in Scrum\r3. Hands on exercise to convert weak stories into strong ones via grooming session","length":"60","room":"Room 308","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"53","title":"Building the Machine Society","track":"Cloud, Functional Languages, Mobile","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"wilkie","presenter_id":"55","description":"Using my qualifications as a distributed systems researcher, I will discuss how we can build a ubiquitous system to share computation and code among everybody in the world. In a nutshell, this is a system where all of our devices communicate by routing through each other (sometimes referred to as a mesh network.) They trade information about the world and about which pieces of code work best and the amount of trust they have about others in the world. Using this information, they can make very educated decisions to promote the best, most correct code for your system over time. They can also share computation and answers to computational problems with others. This is very much the next generation and one possible direction for the current \"cloud\" infrastructures where control and power is distributed back to the hands of individual people.\r\rWith the goal being availability of code to every person on the planet, I will discuss the design, structure, and requirements most of which we already have developed. For instance, which network protocols we will use. What does the system model look like and how do people communicate? What might a typical device that we use look and act like?\r\rWhen the system is built, and to further the motivation, I will talk about the various benefits of such a system: a promotion of computation in the third world. This implies a further lowering of the barrier of entry to technology \/ making technology cheaper in both educational effort and monetary cost. Also, a novel approach to subverting censorship and central authority and governmental control over computation.\r\rNaturally, this system is not without fault or obstacle, so I also will spend time on the drawbacks or hurdles and ways to mitigate them: How do we trust others? How can we push this new model on a world that fears change? How do we make hardware cheap enough to distribute to lower wealth nations?","length":"60","room":"Room 310","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"54","title":"Entity Framework Code-First Migrations","track":"Object Oriented Languages, Relational Database","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Sam Nasr","presenter_id":"51","description":"Code First Migrations allow for database changes to be implemented all through code. Through the use of Package Manager Console, commands can be used to scaffold database changes.  This gives the developer complete control over database migrations within code files. In this presentation, we’ll look at these PMC commands for generating code.","length":"60","room":"Room 311","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"55","title":"Getting the Most Out of Your Page Objects","track":"Testing","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Joel Mason","presenter_id":"31","description":"The Page Object Pattern is one of the foundational elements in building sustainable web UI tests.  This course will use Selenium Web Driver to explore the Page Object Pattern, talk about the reasons to use the pattern, look at ways to make implementations of the pattern better and examine anti-patterns around Page Objects so that we can identify areas of improvement in our code.","length":"60","room":"Room 314","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"56","title":"Messaging with RabbitMQ","track":"NoSQL Database","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Handerson Gomes","presenter_id":"19","description":"This session will cover 3 main topics on Messaging and RabbitMQ.\r- Quick introduction to what is messaging and advantages of using it. In this section I'll try to explain why using a NoSQL DB for queue is usually a bad idea.\r- Introduction to RabbitMQ: How to start using it right way and why. I'll go through the main architectural designs of RabbitMQ and how to use it properly.\r- Tips, tricks and lessons learned based on my experience with a production system using RabbitMQ at the core.","length":"60","room":"Room 317","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"57","title":"Windows Phone 8 Development Success Tips","track":"Mobile","timeslot":"9:15 - 10:15","timeslot_id":"17","presenter":"Steven Hook","presenter_id":"54","description":"\"This session is not your typical Microsoft \"\"You can do it in 20 minutes!\"\" presentation. This is the story of Yinzlate for Windows Phone 8 and how it was a proven out and deployed to a developer device in 15 minutes but yet it took two months to ship it.\r\rThis session studies some of the crucial tips you need to consider when building Windows Phone apps. We'll cover some soft topics around design, user experience, and marketing as well as covering how all that soft stuff converts to code by seeing how Yinzlate did it.\r\rThis talk will cover topics like:\r\r- Use what the phone gives you: Find uses for the features and sensors that the Windows Phone 8 hardware provides you. Find out everything you ever wanted to know about the Windows Phone speech API.\r\r- Doing more with less: Find out how to make features \"\"fun\"\" and give them an integrated feel even if they are very simple code tasks.\r\r- Respect your users: Learn about error handling in a way that makes your users appreciate your help rather than loathe your existence. Tips on how to think more about user experience and less about what's easy for you to code.\r\r- Market it: No, really. Market it, don't just tweet about it. Sure your app only costs $0.99 but you're never going to get that unless you market it like it's $99.00. We'll talk about tips on how to do that.\r\rLinks for the session:\rhttp:\/\/yinzlate.com\rhttp:\/\/bit.ly\/Yinzlate\"","length":"60","room":"Room 313","notes":null,"created":null,"modified":null,"active":"1","track_id":null},{"id":"58","title":"Realtime Collaboration Apps in the Browser with node.js, socket.io, and Twilio","track":"JavaScript, Presentation","timeslot":null,"timeslot_id":"17","presenter":null,"presenter_id":"61","description":"The technologies for creating realtime applications have never been better.  On the server side, the event-driven architecture of node.js is tailor-made for real time applications.  Libraries like socket.io make it effortless to set up server-side push over super fast web sockets.  Add in Twilio for client presence and voice chat, and you've got a killer platform for building business collaboration applications.\r\n\r\nAfter a (very) brief overview of node, socket.io, and Twilio, we will dive into a group programming application to collaboratively write code in the browser (using the awesome Ace code editor).  We'll step through the code on the client and server side to show you how you can create awesome collaboration apps for desktop web browsers.","length":"60","room":"Room 312","notes":null,"created":"2013-05-21 00:47:55","modified":"2013-05-22 19:19:21","active":"1","track_id":null}]}