{"presenters":[{"id":"1","name":"Aaron J. Radke","email":"","twitter":"radke","blog_url":"http:\/\/drx.cc\/cv","github_id":"aradke","bio":"Dr. Aaron J. Radke (@radke) has broad industry and academic experience with advanced degrees in physics, engineering and computer science. He has a joy in exploring science and creating tools.  He currently combines these interests in the field of control theory working with rockets at Lockheed Martin.\r\rHis recent interests revolve around developing tools that help humans tell machines what todo.\r\rHe has given talks on Scala and courses on Control Theory. A list of his background, presentation and papers is available at http:\/\/drx.cc\/cv","created":null,"modified":null,"active":"1","fullname":"Aaron J. Radke"},{"id":"2","name":"Adam Kalnas","email":"","twitter":"@Kalnas","blog_url":"","github_id":"AdamKalnas","bio":"Adam has a strong background in healthcare related software development and is currently a Lead Software Developer at Omnyx.  He's passionate about crafting stable, uncomplex code with a high degree of automated test coverage.  He enjoys eliminating or automating painful processes, and all things agile.  Adam is currently working on a project that utilizes a multi-axis robotic arm for glass slide placement in order to automate the process of capturing of high resolution digital images of human tissue samples.  Adam’s interests and hobbies include disc golfing, gaming (computer and board), as well as home brewing meads and wines.","created":null,"modified":null,"active":"1","fullname":"Adam Kalnas"},{"id":"3","name":"Alison Alvarez","email":"","twitter":"","blog_url":"","github_id":"","bio":"Alison Alvarez is a Software Engineer and Computational Linguist working at Rhiza labs in the Shadyside Neighborhood of Pittsburgh.  She has a dual degree from the George Washington University in Computer Science and Japanese and has a MS in Language Technologies from the School of Computer Science at Carnegie Mellon University.  She once won a New Yorker contest for dressing up a chicken like a literary figure.","created":null,"modified":null,"active":"1","fullname":"Alison Alvarez"},{"id":"4","name":"Ben Lesh","email":"","twitter":"benlesh","blog_url":"http:\/\/www.benlesh.com","github_id":"blesh","bio":"I've been developing websites professionally for fifteen years. I'm a bit of a nut about JavaScript.","created":null,"modified":null,"active":"1","fullname":"Ben Lesh"},{"id":"5","name":"Benjamin Bykowski","email":"","twitter":"Sirius_B","blog_url":"3099 Stone Wheel St","github_id":"SiriusBits","bio":"Ben has more than 16 years’ experience in both technology and marketing. Prior to creating Falls Digital, Ben led a team of designers, developers, and technology professionals at a Cleveland-based interactive marketing agency. \r\rWith roots in Ohio, Ben was classically trained in computer science & engineering at the University of Toledo.  A life-long learner, Ben earned an MBA from Case Western. Ben is a Microsoft Certified Professional and a member of the Information Architecture Institute and Interaction Design Association. \r\rOff the grid, Ben is the married father of three boys and is civically engaged in his local and regional community. He enjoys sailing, snowboarding, traveling, reading, and is a practiced chef and DJ.","created":null,"modified":null,"active":"1","fullname":"Benjamin Bykowski"},{"id":"6","name":"Bill Laboon","email":"","twitter":"@BillLaboon","blog_url":"http:\/\/billlaboon.com","github_id":"laboon","bio":"Bill Laboon is a Senior Software Engineer at the UPMC Technology Development Center.  He has over a dozen years of experience as a professional software engineer in a variety of roles.  You can usually find him caffeinated and coding, or at a Pittsburgh Ruby Brigade meet-up.","created":null,"modified":null,"active":"1","fullname":"Bill Laboon"},{"id":"7","name":"Bob Bartz","email":"","twitter":"@mentalvortex02","blog_url":"http:\/\/www.linkedin.com\/in\/bobbartz","github_id":"","bio":"Returning to the Pittsburgh area last year after 12 years in Columbus, Ohio, Bob is currently a Senior Business Analyst at AssetNation, a Ritchie Bros. company.  He serves as the primary BA for new development and enhancements to Ritchie Bros. EquipmentOne, the world's largest online selection of equipment and commercial materials (www.equipmentone.com).\r\rStarting as a desktop technician after graduating college in 1996, Bob worked at several client sites in Pittsburgh as a Systems Administrator, obtained his Microsoft Certified Systems Engineer certification and later transitioned into the Project Management\/Business Analysis arena during his time in Columbus. He holds a Communications degree from Fredonia State University in upstate New York and currently holds certifications as a Certified ScrumMaster and a Certified Associate in Project Management.\r\rAs part of his ongoing professional development, Bob participates as a member of the Pittsburgh Project Management Institute chapter and the Pittsburgh Agile Meetup group. While away from work, he enjoys spending time with his wife and four children travelling, visiting museums, and attending his children’s various activities. Bob is also a member of Holy Wisdom Parish Latin Mass Community and participates in many of the group’s events throughout the year.","created":null,"modified":null,"active":"1","fullname":"Bob Bartz"},{"id":"8","name":"Brent Schooley","email":"","twitter":"brentschooley","blog_url":"http:\/\/brentschooley.com","github_id":"","bio":"Brent is a software developer who has been working with Microsoft technologies since 2004. His interests include client and mobile application development and user experience design with a recent emphasis on Windows 8 and Windows Phone. Other platforms he has worked with include WPF, Silverlight, Windows Forms, and iOS. He is an Evangelist working for Infragistics with a focus on mobile platforms. He has a passion for making people’s experiences with software the best that they can possibly be.  Brent is the author of Designing for Windows 8, a Windows 8 design primer, coming in January from Apress.","created":null,"modified":null,"active":"1","fullname":"Brent Schooley"},{"id":"9","name":"Brian Minisi","email":"","twitter":"brianminisi","blog_url":"brian.minisi.net","github_id":"","bio":"Brian Minisi has been developing software for 15 years, starting with Cold Fusion, ASP and VB6.  Brian moved into .NET as part of the early adopters program and has delivered a wide variety of web sites and applications since.  Other areas of concentration include Business Intelligence, SQL Server, and ALM solutions using Team Foundation Server.  Brian is a Software Architect for CEI America (www.ceiamerica.com), a Microsoft Gold Partner.  As a current Microsoft ALM Ranger, Brian participates in delivering out-of-band solutions for Visual Studio and Team Foundation Server.","created":null,"modified":null,"active":"1","fullname":"Brian Minisi"},{"id":"10","name":"Carol Nichols & Chris Winters","email":"","twitter":"@carols10cents","blog_url":"http:\/\/carol-nichols.com","github_id":"carols10cents","bio":"Carol is a Software Architect at Think Through Math[1] in Pittsburgh. She's also a maintainer of rstat.us[2] and helps to plan Steel City Ruby Conf [3]. She loves Pittsburgh, Ruby, and cats.\r\n\r\nChris has been solving problems big and small with software for 15 years. He's been active in the Perl community, helps steer the Pittsburgh Java User Group, and has been steeping in Ruby for the last year and a half. He's a Senior Technical Consultant at Summa Technologies.\r\n\r\n[1] - http:\/\/thinkthroughmath.com\r\n[2] - http:\/\/rstat.us\r\n[3] - http:\/\/steelcityrubyconf.org","created":null,"modified":"2013-05-16 12:05:14","active":"1","fullname":"Carol Nichols & Chris Winters"},{"id":"11","name":"Constantine Aaron Cois","email":"","twitter":"aaroncois","blog_url":"www.codehenge.net\/blog","github_id":"cacois","bio":"Aaron is a software engineer currently located in Pittsburgh, PA. He received his Ph.D. in 2007, developing algorithms and software for 3D medical image analysis. He currently leads a software development team at Carnegie Mellon University, focusing on web application development and cloud systems.\r\rAaron is a polyglot programmer, with a keen interest in open source technologies. Some favorite technologies at the moment include Node.js, Python\/Django, MongoDB, and Redis.","created":null,"modified":null,"active":"1","fullname":"Constantine Aaron Cois"},{"id":"12","name":"Craig Kerstiens","email":"","twitter":"craigkerstiens","blog_url":"http:\/\/www.craigkerstiens.com","github_id":"craigkerstiens","bio":"I'm part of the team at Heroku. I've worked with a variety of languages and technologies and am currently part of the Heroku Postgres team.","created":null,"modified":null,"active":"1","fullname":"Craig Kerstiens"},{"id":"13","name":"Craig Purnell","email":"","twitter":"@CraigPurnell","blog_url":"www.craigpurnell.com","github_id":"","bio":"Craig Purnell is currently a Technical Instructor with New Horizons. Before joining New Horizons, he spent over 10 years as the Database Administrator at a large Midwestern law firm.  He has been in IT for 14 years and has spent his entire career working with enterprise databases and ERP systems. Craig is an active member of the Ohio North SQL Server User Group and has presented at many user groups, SQL Saturdays, and the PASS Summit in 2012","created":null,"modified":null,"active":"1","fullname":"Craig Purnell"},{"id":"14","name":"Dane Morgridge","email":"","twitter":"danemorgridge","blog_url":"http:\/\/www.danemorgridge.com","github_id":"danemorgridge","bio":"Dane Morgridge has been a programmer for 10+ years and has worked with numerous technologies in this time.  In addition to software development he draws comics (codemonkeykungfu.com), plays the drums, is the host of the Community Megaphone Podcast. He can be reached through http:\/\/www.danemorgridge.com or on Twitter @danemorgridge.","created":null,"modified":null,"active":"1","fullname":"Dane Morgridge"},{"id":"15","name":"Dave Shah & Steve Jackson","email":"","twitter":"@daveshah, @stevejxsn","blog_url":"www.leandog.com","github_id":"leandog","bio":"Dave Shah and Steve Jackson are developers at LeanDog in Cleveland.  They love creating unique solutions and solving impossible problems with software.  They are passionate about writing code and writing it well.  Steve and Dave are dedicated to improving the craft of delivering software and fostering environments where professionals want to continuously improve.","created":null,"modified":null,"active":"1","fullname":"Dave Shah & Steve Jackson"},{"id":"16","name":"Dr. Charles Suscheck","email":"","twitter":"","blog_url":"","github_id":"","bio":"Dr. Charles Suscheck specializes in software development methodologies, and project management.  He has over 25 years of professional experience in information technology, beginning his career as a software developer.  Dr. Suscheck’s holds a Doctorate, Masters, and Bachelors in Computer Science and is a Professional Scrum Trainer (PST), Professional Scrum Master (PSM I and II), Certified Scrum Master (CSM), certified Scrum Practitioner (CSP) and certified RUP specialist.  An educator at heart, he has over 30 published articles and conference proceedings and has spoken nationally and internationally at conferences such as OOPSLA, ECOOP, Agile 20xx, and Borcon on a wide variety of topics.","created":null,"modified":null,"active":"1","fullname":"Dr. Charles Suscheck"},{"id":"17","name":"Franklin Chen","email":"","twitter":"@FranklinChen","blog_url":"http:\/\/franklinchen.com\/","github_id":"FranklinChen","bio":"I am a polyglot pragmatic programmer who strives to write correct and\rclear code that gets stuff done. I especially like to get the computer\rto do stuff for me.","created":null,"modified":null,"active":"1","fullname":"Franklin Chen"},{"id":"18","name":"Greg Lutz","email":"","twitter":"@ComponentOne","blog_url":"http:\/\/our.componentone.com\/author\/c1_gregl\/","github_id":"","bio":"Greg is currently a product manager at ComponentOne where he manages the company’s set of XAML-based developer tools for Silverlight, WPF, WinRT and Windows Phone. He has a passion for anything from Microsoft and anything that’s based on XAML (including LightSwitch!). When he’s not busy planning the future of his products, he spends time developing samples, writing blog posts and documenting tutorials to help flourish the .NET developer community with valuable resources.","created":null,"modified":null,"active":"1","fullname":"Greg Lutz"},{"id":"19","name":"Handerson Gomes","email":"","twitter":"handersongomes","blog_url":"http:\/\/www.summa-tech.com\/blog\/","github_id":"","bio":"I've been writing, testing and deploying software for the last 15 years, using a wide range of technologies and environments. I have been using RabbitMQ in the last year and would like to share some insights on why this is a great tool to have in our toolbox.\r\rI am a Distinguished Technical Consultant at Summa Technologies and a co-organizer of Pittsburgh Geek Out Days (http:\/\/www.pghgeekoutday.com\/)","created":null,"modified":null,"active":"1","fullname":"Handerson Gomes"},{"id":"20","name":"Hector Castro","email":"","twitter":"hectcastro","blog_url":"","github_id":"hectcastro","bio":"Hector Castro is a Technical Evangelist at Basho Technologies [0], the sponsors of Riak [1], an open-source distributed database. Previously, he was a software engineer at Wharton Research Data Services (WRDS) [2], where he worked on enabling full-text search for Securities and Exchange Commission (SEC) documents. He also co-organizes Philly DevOps [3], a DevOps user group in Philadelphia. Hector lives and works in Philadelphia, Pennsylvania.\r \r[0] http:\/\/basho.com\/\r[1] https:\/\/github.com\/basho\/riak\r[2] https:\/\/wrds.wharton.upenn.edu\/\r[3] http:\/\/phillydevops.org\/","created":null,"modified":null,"active":"1","fullname":"Hector Castro"},{"id":"21","name":"Hector Correa","email":"","twitter":"hectorjcorrea","blog_url":"http:\/\/hectorcorrea.com\/blog","github_id":"hectorcorrea","bio":"Software Developer in State College, PA.","created":null,"modified":null,"active":"1","fullname":"Hector Correa"},{"id":"22","name":"Hemant Singh","email":"","twitter":"singhhemant","blog_url":"http:\/\/singhhemant.wordpress.com\/","github_id":"","bio":"Hemant Singh is a consultant and architect specializing in Microsoft development technologies. Hemant is currently working as a Senior Applications developer with Creehan & Company. Over the last 11 years he has been developing applications using Microsoft platforms and solutions. Earlier, Hemant has worked for several consulting firms as a software developer. During those years he developed solutions for clients in the manufacturing, transportation, infrastructure and healthcare industries.","created":null,"modified":null,"active":"1","fullname":"Hemant Singh"},{"id":"23","name":"Irwin Hurst","email":"","twitter":"irwinhurst","blog_url":"","github_id":"irwinhurst","bio":"Irwin Hurst is an Associate Architect at CEI America.  He has previously started a successful software company and placed second at the first Pittsburgh Startup Weekend.  He also organizes an annual Pittsburgh GiveCamp where developers donate their time to help local non-profits.","created":null,"modified":null,"active":"1","fullname":"Irwin Hurst"},{"id":"24","name":"Jackie Vesci","email":"","twitter":"@JVesci","blog_url":"http:\/\/www.3hourlocal.com\/","github_id":"","bio":"Founder and editor of 3HourLocal.com, a website to connect Pittsburgh through community events. Social media and networking enthusiast. Enjoys all things startup, community and technology related. Born and raised in Pittsburgh, PA.","created":null,"modified":null,"active":"1","fullname":"Jackie Vesci"},{"id":"25","name":"Jared Faris","email":"","twitter":"jaredthenerd","blog_url":"jaredthenerd.com","github_id":"jaredfaris","bio":"Jared is the lead software engineer at Facio, a startup building tools to visualize how people work together to improve their happiness and productivity. He spends a lot of his time experimenting with technologies and teaching others about them. He's a strong advocate of cloud computing and is passionate about user experience. He's a cofounder of the CloudDevelop conference and frequent speaker at regional events. You can find out more about him at http:\/\/jaredthenerd.com or follow him @jaredthenerd.","created":null,"modified":null,"active":"1","fullname":"Jared Faris"},{"id":"26","name":"Jason Agostoni","email":"","twitter":"jagostoni","blog_url":"http:\/\/jason.agostoni.net","github_id":"jagostoni","bio":"Jason has over 13 years of experience in software development, architecture and design in addition to several years of project management. Having worked for large, global manufacturing company, he has specialized skills in enterprise application design, development and management but also has equal experience in smaller business-oriented applications. In addition to software development experience, Jason has spent time developing content for and performing mentoring including SharePoint, BizTalk, TFS, Software Architecture, and general .NET. Additionally, Jason has deep experience in non-Microsoft platforms such as iOS development and PHP development.","created":null,"modified":null,"active":"1","fullname":"Jason Agostoni"},{"id":"27","name":"Jeremy Jarrell","email":"","twitter":"@jeremyjarrell","blog_url":"www.jeremyjarrell.com","github_id":"JeremyJarrell","bio":"Jeremy Jarrell is a professional software developer specializing in commercial application development for the enterprise space.  He is heavily involved in the local developer community, both as a regular presenter throughout the East Coast as well as an author whose articles have appeared on sites such as Simple-Talk.com and DZone.com.\r\rJeremy loves to discuss all topics related to software development and can be reached either by Twitter at @jeremyjarrell or at his website, www.JeremyJarrell.com.","created":null,"modified":null,"active":"1","fullname":"Jeremy Jarrell"},{"id":"28","name":"Jerrel Blankenship","email":"","twitter":"@TheJerrel","blog_url":"jerrelblankenship.com","github_id":"jerrelblankenship","bio":"Jerrel is a software craftsman specializing in Microsoft technologies. He's developed .NET projects spanning from traditional desktop to web and mobile apps. He's a big proponent of agile development and spends his time working with and teaching developers who want to learn to build software more effectively. He's literally written the the book about agile .NET development (Pro Agile .NET Development with SCRUM, Apress, 2011). When he's not being a developer he invests his time and energy into his family, fishing, chess, Cleveland sports teams and gaming. You can read Jerrel's ramblings at www.jerrelblankenship.com.","created":null,"modified":null,"active":"1","fullname":"Jerrel Blankenship"},{"id":"29","name":"Joel Byler","email":"","twitter":"@joelbyler","blog_url":"joelbyler.github.com","github_id":"joelbyler","bio":"Joel is a software craftsman working at LeanDog in Cleveland, OH.  During the day he spends his time working on enterprise Java apps and at night contributes to several open sourced Ruby projects.  He is also the organizer for the Cleveland Ruby Brigade.","created":null,"modified":null,"active":"1","fullname":"Joel Byler"},{"id":"30","name":"Joel Cochran","email":"","twitter":"joelcochran","blog_url":"http:\/\/joelcochran.com","github_id":"","bio":"Joel Cochran is a Manager Consultant with Sogeti, an international consulting firm.  He is a Microsoft Expression Blend MVP, an ASPInsider, and is currently serving as the INETA Mentor for Virginia. Joel is the author of \"Expression Blend in Action\" and co-author of \"Windows 8 Apps with HTML5 and JavaScript\", both by Manning Publications, as well as \"The Practical MVVM Manifesto\" (http:\/\/practicalmvvm.com). A technology generalist, he works with technologies such as Windows 8, ASP.NET MVC4, SQL Server, SSIS, Azure, and much more. His languages of choice are C# and JavaScript. He spends an inordinate amount of time on Twitter (@joelcochran) and far less time on his blog http:\/\/joelcochran.com.","created":null,"modified":null,"active":"1","fullname":"Joel Cochran"},{"id":"31","name":"Joel Mason","email":"","twitter":"@jamason05","blog_url":"www.craftoverart.com","github_id":"joelmason","bio":"I am an aspiring software craftsman currently working in the healthcare arena as a Software Developer IV at McKesson Automation. I also have had the opportunity to teach a hands-on Software Engineering course at Geneva College for the past several years.\r\rSome of my current technical interests include Behavior Driven Development, test automation and building distributed systems.  I also enjoy mentoring and working to improve team performance.","created":null,"modified":null,"active":"1","fullname":"Joel Mason"},{"id":"32","name":"John Hidey, Sujesh Arukil","email":"","twitter":"@sujesharukil","blog_url":"","github_id":"https:\/\/github.com\/sujesh","bio":"John Hidey is the Co-Founder and Principal Architect at Sharpdudes, LLC. John specializes in Microsoft technologies such as ASP.Net, Smart Clients, Database and the .Net framework. When not immersed in his designs and code, John likes to take time off and talk about technology and Mickey Mouse. \r\rSujesh Arukil is the Front End Architect at CECity.com, Inc. He loves to design and work on various front end technologies such as HTML, CSS and plain old Javascript. Sujesh is an ardent fan of Microsoft technologies such as ASP.Net and ASP.Net MVC. Just like John, when not immersed in his designs and code, Sujesh likes to take time off and talk about technology and Cell Phones.","created":null,"modified":null,"active":"1","fullname":"John Hidey, Sujesh Arukil"},{"id":"33","name":"John K. Paul","email":"","twitter":"johnkpaul","blog_url":"http:\/\/johnkpaul.com","github_id":"johnkpaul","bio":"John K. Paul is the Lead Architect at Conde Nast and former lead front end software engineer at TheLadders.com.  He is a contributor to numerous open source projects including learn.jquery.com.  He has spoken to various startups around NYC about front end development, and scalable engineering practices, in particular, unit testing javascript. Additionally, he has taught Javascript and jQuery fundamentals to teams throughout the NYC area.","created":null,"modified":null,"active":"1","fullname":"John K. Paul"},{"id":"34","name":"John V. Petersen","email":"","twitter":"johnvpetersen","blog_url":"codebetter.com\/johnvpetersen","github_id":"johnvpetersen","bio":"John Petersen has been developing software for over 20 years. It all started when, as a staff accountant, he was asked to get involved in a system upgrade to replace an old IBM Series 1 computer (about the size of a large refrigerator!). Those first programs were written in Clipper, summer 87. Since that time, tools included dBase, FoxBase, Visual FoxPro and Visual Basic. An early adopter of .NET, he then decided to go to law school. After practicing law for a few years, John realized that technology was a lot more interesting than the law. Today, John focuses on ASP.NET development and is having more fun than ever solving for clients. John is a Practice Director for Custom Application Development at Neudesic, a Microsoft Gold Partner and the Trusted Technology Partner in Business Innovation.  A 9 time recipient of Microsoft’s Most Valuable Professional Award, John is a current ASP.NET\/IIS MVP. John is also an ASP Insider and is the INETA Mentor for PA and WV. John is the author of several books and is a frequent contributor to Code Magazine and DevConnections Magazines. John holds a BS in Business Administration from Mansfield University, an MBA in Information Systems from St. Joseph’s University and a JD from the Rutgers School of Law – Camden.","created":null,"modified":null,"active":"1","fullname":"John V. Petersen"},{"id":"35","name":"Jorge Balderas","email":"","twitter":"jorgerbf","blog_url":"","github_id":"","bio":"Jorge is a Distinguished Technical Consultant with Summa Technologies, Inc.   Jorge has helped clients navigate through the technology challenges presented by enterprise efforts by helping organizations establish and leverage best practices that support the organization’s objectives.","created":null,"modified":null,"active":"1","fullname":"Jorge Balderas"},{"id":"36","name":"Josh Gretz","email":"","twitter":"joshgretz","blog_url":"http:\/\/www.codestuffwell.com","github_id":"jgretz","bio":"Josh Gretz is a Senior Innovation Architect at TrueFit, and his passion is solving problems with technology. His quest to better the world through software has led him down many paths, but these days you will find him in the mobile and web realms. You can follow the journey on his blog: CodeStuffWell.com\r\rA graduate of Grove City College, Josh earned his B.S. in Computer Information Systems with a minor in business. Giving back to the community is also a huge part of Josh's life — for instance, as an adjunct professor at Grove City College, Josh teaches a class on iOS development. Whether its wrestling code into submission or helping to shape the bright minds of the future, Josh is committed to leaving the world a little bit better than he found it.\r\rJosh resides in Cranberry Township with his wife, three sons, and a labradoodle. When he's not being beguiled by code, you can find him playing basketball, working with youths, and watching any sport known to man (seriously, he stays up late to watch Olympic Handball).","created":null,"modified":null,"active":"1","fullname":"Josh Gretz"},{"id":"37","name":"Josh Suereth","email":"","twitter":"jsuereth","blog_url":"jsuereth.com","github_id":"jsuereth","bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","created":null,"modified":null,"active":"1","fullname":"Josh Suereth"},{"id":"38","name":"Joshua Sager","email":"","twitter":"@joshsager","blog_url":"joshsagermedia.com","github_id":"github.com\/joshsager","bio":"Joshua is the Founder of Second Block Studio and the Program Director of Multimedia Technologies for the Pittsburgh Technical Institute where he writes and teaches courses in web design and development. He also serves as co-manager for the code-slamming user group Loop Pittsburgh and frequently teaches workshops on design, development and printmaking to teens as well as working professionals. Joshua is passionate about interactive technologies and loves to build things for all sizes and devices.\r\rPreviously, he has spoken at conferences such as Web Design Day, FlashBelt, FlashPitt and Podcamp Pittsburgh.  \r\rI'm currently teaching Web Design for Designers Workshop http:\/\/www.refreshpittsburgh.org\/webfordesigners\/ with my good friends Andrew Twigg and Val Head.","created":null,"modified":null,"active":"1","fullname":"Joshua Sager"},{"id":"39","name":"Julie Pagano","email":"","twitter":"juliepagano","blog_url":"http:\/\/juliepagano.com\/blog","github_id":"juliepagano","bio":"Julie is a software engineer who likes to focus on the front-end and user experience. When she's not working at her day job, she focuses on championing diversity in tech and building the Pittsburgh tech community. She co-organizes and teaches classes for the Pittsburgh chapter of Girl Develop It, an organization that helps teach women how to code. She also helps organize Steel City Ruby Conf, an awesome community-focused Ruby conference in Pittsburgh.","created":null,"modified":null,"active":"1","fullname":"Julie Pagano"},{"id":"40","name":"Kim Hardy","email":"","twitter":"","blog_url":"http:\/\/saltconsulting.wordpress.com\/","github_id":"","bio":"I am a Benevolent Challenger. I am not challenging people’s beliefs; rather I am challenging them to express the best in themselves. I call out to their potential, refusing to let them squander their talent. I am brimming with ideas about how to make the process of discovery compelling, invigorating, essential even. While I inspire, I am also often inspired. Excited by newfound ideas, I’ll tell anyone who’ll listen. I can often be heard exclaiming, “Isn’t this the coolest concept you’ve ever heard?!” or “Isn’t that the most brilliant idea?!” I never quite understand why more people are not as thrilled as I am… ©\r\rI have a BS in Computer Science; a MS in Information Science – Systems Design; and over 20 years of experience as a Programmer, Software Architect, Project Manager and Systems Analyst. I am also a Certified ScrumMaster.\r\rwww.linkedin.com\/pub\/kim-hardy\/b\/248\/533","created":null,"modified":null,"active":"1","fullname":"Kim Hardy"},{"id":"41","name":"Klaatu","email":"","twitter":"","blog_url":"http:\/\/straightedgelinux.com\/blog","github_id":"notklaatu","bio":"Klaatu is a unix geek and enthusiast. He does some podcasting, web design, and multimedia production and programming. He is the current maintainer of <a href=\"http:\/\/slackermedia.info\">Slackermedia<\/a>, <a href=\"http:\/\/nongnu.org\/screenwriter\">Screenwriter.el<\/a>, and a number of <a href=\"http:\/\/slackbuilds.org\">Slackbuilds<\/a>.","created":null,"modified":null,"active":"1","fullname":"Klaatu"},{"id":"42","name":"Larry Ullman","email":"","twitter":"@LarryUllman","blog_url":"http:\/\/www.larryullman.com","github_id":"","bio":"Larry Ullman is a writer, Web and software developer, trainer, instructor, speaker, and consultant. He has written 24 books and numerous articles. His books have sold over 350,000 copies world wide in more than 20 languages. As his readers, students, and co-workers can attest, Larry’s strength is in Translating Geek into English: converting the technical and arcane into something comprehensible and useful.","created":null,"modified":null,"active":"1","fullname":"Larry Ullman"},{"id":"43","name":"Matthew D. Groves","email":"","twitter":"mgroves","blog_url":"http:\/\/mgroves.com","github_id":"mgroves","bio":"Matthew D. Groves is a guy who loves to code.  It doesn't matter if it's \"enterprisey\" C# apps, cool jQuery stuff, contributing to OSS, or rolling up his sleeves to dig into some PHP.  He has been coding professionally ever since he wrote a QuickBASIC point-of-sale app for his parent's pizza shop back in the 90s.  He currently works from home on the Telligent product team, and loves spending time with his wife and 2 kids, watching the Cincinnati Reds, and getting involved in the developer community.  He is currently writing a book for Manning about aspect-oriented programming in .NET, and also teaches a class on web development at Capital University in Columbus, Ohio.","created":null,"modified":null,"active":"1","fullname":"Matthew D. Groves"},{"id":"44","name":"Michael S. Collier","email":"","twitter":"@MichaelCollier","blog_url":"http:\/\/www.michaelscollier.com","github_id":"","bio":"Michael Collier is a Windows Azure MVP and serves as a National Architect for Neudesic, a Microsoft SI partner that specializes in Windows Azure.  He has nearly 12 years of experience building Microsoft-based applications for a wide range of clients. Michael spends his days serving as a developer or architect – helping clients succeed with the Microsoft development platform. He also enjoys speaking about Windows Azure at local user groups, as well as regional and national conferences.  Michael is the founder of CloudDevelop, as well as the Central Ohio Cloud Computing User Group in Columbus, OH.  You can follow Michael on Twitter at www.twitter.com\/MichaelCollier and on his blog at www.MichaelSCollier.com.","created":null,"modified":null,"active":"1","fullname":"Michael S. Collier"},{"id":"45","name":"Nate Good","email":"","twitter":"nategood","blog_url":"http:\/\/blog.nategood.com","github_id":"nategood","bio":"Nate is currently playing the role Director of Engineering at ShowClix.  He's worked and studied at places like NIST and Dept. of VA but has a real love for the startup world.  He helps host Node.pgh and founded First Bytes Society (firstbytes.org), an organization to teach tweens the art of hacking.","created":null,"modified":null,"active":"1","fullname":"Nate Good"},{"id":"46","name":"Nivia Henry","email":"","twitter":"@Lanooba","blog_url":"","github_id":"","bio":"Curious human and woman in technology. Loves cats, Agile, Scrum, Lean, Kanban, Kaizen. LinkedIn profile: www.linkedin.com\/in\/nivia\/","created":null,"modified":null,"active":"1","fullname":"Nivia Henry"},{"id":"47","name":"Noopur Davis","email":"","twitter":"noopurdavis","blog_url":"ndavis@davissys.com","github_id":"","bio":"I am a Principal of Davis Systems.  As an Enterprise Coach, over a dozen years I have worked with the nations' most admired companies such as Intuit, Adobe, Microsoft, and Hewlett Packard.  I have worked with dozens of organizations, trained thousands of software professionals and executives, and coached a few hundred teams.  I is a CSM, CSPO, CSP, and Scrum Developer, a Team Software Process Mentor coach (one of a dozen in the world), a Carnegie Mellon University Software Engineering Institute Strategic Partner (one of only three in the world), and a past Visiting Scientist at CMU.  \r\rMy current interest is working with Agile and Scale:  transforming entire organizations and enterprises.\r\rI have  degrees in Electrical Engineering and Computer Science.","created":null,"modified":null,"active":"1","fullname":"Noopur Davis"},{"id":"48","name":"Reed Powell","email":"","twitter":"","blog_url":"","github_id":"","bio":"Reed Powell is currently a ColdFusion database application developer and manager of the Pittsburgh Adobe ColdFusion user group.  He has been working with ColdFusion since the late 90s, and has been programming professionally since the mid 70s.  He has been a national and regional speaker on topics related to technology and genealogy research.","created":null,"modified":null,"active":"1","fullname":"Reed Powell"},{"id":"49","name":"Rich Dudley","email":"","twitter":"@rj_dudley","blog_url":"http:\/\/rjdudley.com\/blog\/","github_id":"https:\/\/github.com\/rjdudl","bio":"Rich is a Senior Software Engineer for Quicken Loans, working with ASP.NET MVC, SQL Server, CQRS and Entity Framework.  Rich has been using Microsoft technologies to build data driven and BI websites since 2001.  Rich holds an MS in molecular biology, and his work prior to software development includes surviving cholera and purifying radioactive neurotoxins.  Rich is an ASP Insider, Pluralsight trainer and a Packt author.","created":null,"modified":null,"active":"1","fullname":"Rich Dudley"},{"id":"50","name":"Richard Ashkettle","email":"","twitter":"idiotcoder","blog_url":"","github_id":"idiotcoder","bio":"I am the Development Team Lead at Confluence in Pittsburgh.  After spending time writing mobile apps in native languages, I decided to try HTML5 and JavaScript.  In the past two years or so, I've used most of the major frameworks available to create apps and even games for mobile devices.","created":null,"modified":null,"active":"1","fullname":"Richard Ashkettle"},{"id":"51","name":"Sam Nasr","email":"","twitter":"@SamNasr","blog_url":"http:\/\/clevelanddotnet.blogspot.com\/","github_id":"","bio":"Sam Nasr has been a software developer since 1995, focusing mostly on Microsoft technologies. Having achieved multiple certifications from Microsoft (MCAD, MCTS(MOSS), and MCT), Sam develops, teaches, and tours the country to present various topics in .Net Framework. He is also actively involved with the Cleveland C#\/VB.Net User Group, where he has been the group leader since 2003. In addition, he also started the Cleveland WPF User Group, is the INETA Mentor for Ohio, and an author for Visual Studio Magazine. When not coding, Sam loves spending time with his family and friends or volunteering at his local church.","created":null,"modified":null,"active":"1","fullname":"Sam Nasr"},{"id":"52","name":"Scott Smith and Lou Laughlin","email":"","twitter":"@LouLaughlin","blog_url":"","github_id":"","bio":"Scott and Lou, longtime residents of the Pittsburgh area, work as full time Agile Coaches at McKesson Automation in Cranberry Township. They both sport many entries on their resumes, including many years as software developers. In addition to being coaches at work, they are both fathers and one is a grandfather. \r\rFrom their experiences through life and work, they are both ready and willing to share their knowledge of Agile and their work practices to help improve the Pittsburgh development community.","created":null,"modified":null,"active":"1","fullname":"Scott Smith and Lou Laughlin"},{"id":"53","name":"Stephen Sebeny","email":"","twitter":"ssebeny","blog_url":"","github_id":"","bio":"I've been a Mac user since 1991, and a Mac software developer since 2002. Currently employed at Smith Micro Software as a Mac Software Engineer.","created":null,"modified":null,"active":"1","fullname":"Stephen Sebeny"},{"id":"54","name":"Steven Hook","email":"","twitter":"@StevenHook","blog_url":"http:\/\/hookscode.com","github_id":"","bio":"Steven Hook is experienced in C#, JavaScript, ASP.NET MVC, Windows Phone, Windows Store Apps. In his six years of industry experience, he has built next generation solutions in sports using ASP.NET MVC and Silverlight for coaches, players, and officiating at the college and professional levels. Most recently, he is employed with Gateway Ticketing Systems bringing a fresh look into the ticketing industry by developing unique solutions to industry problems. He also develops applications for fun in the interest of solving real world problems.\r\rYou can read his blog at http:\/\/hookscode.com or follow him on Twitter @StevenHook.","created":null,"modified":null,"active":"1","fullname":"Steven Hook"},{"id":"55","name":"wilkie","email":"","twitter":"wilkieii","blog_url":"http:\/\/blog.davewilkinsonii.com","github_id":"wilkie","bio":"I am a published systems researcher and open source developer. I founded the XOmB kernel (http:\/\/xomb.org), the Djehuty operating system (http:\/\/djehuty.org,) and the http:\/\/rstat.us federated\/distributed microblogging platform. My goals with these projects are to connect people and give more power and control to those who are communicating.","created":null,"modified":null,"active":"1","fullname":"wilkie"},{"id":"56","name":"William Oberman","email":"","twitter":"","blog_url":"","github_id":"","bio":"Will is a veteran engineer and software architect with experience in several start-up ventures including Vivisimo and BodyMedia in Pittsburgh. A graduate of the Carnegie Mellon School of Computer Science, Will has managed complex technology teams and product roll-outs. His work on high-volume customer data collection and analysis, combined with his expertise in consumer-facing web applications, uniquely position him to lead the technological architecture and build-out at CivicScience.","created":null,"modified":null,"active":"1","fullname":"William Oberman"},{"id":"57","name":"Eric Silver","email":"","twitter":"","blog_url":"","github_id":"","bio":"Eric Silver has been a stock investor since age 12, an angel investor for 6 years, and was an early investor in ModCloth, Network Appliance, NoWait, WebKite, Rent Jungle, and many other significant local firms.  Eric will talk through \"rules of thumb\" to use while estimating company value, filters to apply which may render a company unable to raise capital, and offer an overview of risk and returns within angel investing.","created":null,"modified":null,"active":"1","fullname":"Eric Silver"},{"id":"58","name":"Adam Mikolaj","email":"","twitter":"sqlsandwiches","blog_url":"http:\/\/www.sqlsandwiches.com","github_id":"","bio":"Adam is a SQL server DBA who likes to tinker with many types of technology. He's has been working with SQL for several years and still enjoys learning new things.\rAdam is active in the Pittsburgh Powershell and SQL Server user groups.","created":null,"modified":null,"active":"1","fullname":"Adam Mikolaj"},{"id":"59","name":"James Springer","email":"","twitter":"","blog_url":"","github_id":"","bio":"James Springer is a software support engineer at ComponentOne, where he currently serves as the resident Wijmo expert. His focus is on helping developers from diverse programming backgrounds leverage Wijmo's unique and simple approach to using truly adaptive HTML5\/JavaScript tools in their web-based projects. His professional experience also includes over 10 years of graphic design and mobile\/web development for both corporate clients, and small businesses.","created":"2013-05-16 17:46:53","modified":"2013-05-16 19:00:06","active":"1","fullname":"James Springer"},{"id":"60","name":"Matt Gaston","email":"","twitter":"@mattgaston","blog_url":"http:\/\/www.sei.cmu.edu\/about\/people\/profile.cfm?id=gaston_15182","github_id":"","bio":"Dr. Matt Gaston is the Director of the Carnegie Mellon Software Engineering Institute's Emerging Technology Center and an Adjunct Associate Professor at the CMU Institute for Software Research. The SEI Emerging Technology Center demonstrates and transitions edge-of-technology capabilities in the computing and information sciences for critical government missions.  Before joining CMU, Dr. Gaston was the Director of Research for a business unit of General Dynamics C4 Systems. Prior to that, he spent nearly ten years at the National Security Agency developing and applying mission-focused analytics.","created":"2013-05-16 19:31:27","modified":"2013-05-20 12:38:38","active":"1","fullname":"Matt Gaston"},{"id":"61","name":"Kevin Whinnery","email":"","twitter":"","blog_url":"","github_id":"","bio":"Kevin is a front-end hacker and developer evangelist for Twilio, an API company supporting the web and mobile developers that are changing communications forever. Over about a decade of working on rich client apps, Kevin has helped in small ways to deliver #1 App Store hits for iOS and Android, as well as data-driven enterprise apps for the desktop using web technologies, Apache Flex, and\/or Windows Presentation Foundation. \r\n\r\nKevin lives in Saint Paul, MN with his beautiful wife and three devious children.","created":"2013-05-21 00:45:53","modified":"2013-05-21 00:45:53","active":"1","fullname":"Kevin Whinnery"}]}